app/controllers/gossips_controller.rb

	def create
		Gossip.create(gossip_params)
---
INSERT INTO "gossips" ("anonymous_author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["anonymous_author", "test"], ["content", "test"], ["created_at", "2018-01-31 15:22:07.995702"], ["updated_at", "2018-01-31 15:22:07.995702"]]

	def destroy
		@gossips = Gossip.find(params[:id])
		@gossips.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = ?  [["id", 1]]

	def show
		@gossips = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]

	def edit
		@gossips = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]

	def update
		@gossips = Gossip.find(params[:id])
		param = params.require(:gossip).permit(:anonymous_author, :content)
		@gossips.update(param)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = ?, "updated_at" = ? WHERE "gossips"."id" = ?  [["content", "ok"], ["updated_at", "2018-01-31 15:48:50.801460"], ["id", 25]]